[
    {
        "id": "635966b5a9d2d5b4c492f3a9",
        "title": "Complete Python Developer in 2022",
        "price": 19,
        "thumbnail_url": "https://www.codingbytes.com/wp-content/uploads/2020/03/python-programming-course.jpg",
        "photo_url": "https://www.codingbytes.com/wp-content/uploads/2020/03/python-programming-course.jpg",
        "instructor": {
            "name": "Lara Harrison",
            "img": "https://i.ibb.co/RP63JNZ/Avatar-1.png"
        },
        "ratings": {
            "star": 3.5,
            "number": 63
        },
        "details": {
            "heading": "Complete Python Developer in 2022: Zero to Mastery",
            "description": "Learn Python from scratch, get hired, and have fun along the way with the most modern, up-to-date Python course on TechTutor (we use the latest version of Python). This course is focused on efficiency: never spend time on confusing, out of date, incomplete Python tutorials anymore.The curriculum is going to be very hands on as we walk you from start to finish of becoming a professional Python developer. We will start from the very beginning by teaching you Python basics and programming fundamentals, and then going into advanced topics and different career fields in Python so you can get real life practice and be ready for the real world.",
            "topics": " <ul><li>Command Line Basics</li> <li>Installing Python</li><li>Running Python Code</li><li>Strings</li><li>Dictionaries</li> <li>Number Data Types</li><li>Debugging and Error Handling</li><li>Object Oriented Programming</li><li>Advanced Methods</li><li>Print Formatting</li><li>Built-in Functions</li><li>and much more!</li><ul/>",
            "enrolled": 59,
            "level": "Beginner",
            "lectures": 32,
            "duration": "22:41:31",
            "languages": "English"
        }
    },
    {
        "id": "635966b5ae70f31315b76f99",
        "title": "Microsoft Excel for Beginner ",
        "price": 25,
        "thumbnail_url": "https://www.tangolearn.com/wp-content/uploads/2021/10/best-online-excel-courses.jpg",
        "photo_url": "https://www.tangolearn.com/wp-content/uploads/2021/10/best-online-excel-courses.jpg",
        "instructor": {
            "name": "Sean Little",
            "img": "https://i.ibb.co/GMHLbmG/Avatar-2.png"
        },
        "ratings": {
            "star": 3.5,
            "number": 90
        },
        "details": {
            "heading": "Excel with this A-Z Microsoft Excel Course. Microsoft Excel 2010, 2013, 2016, Excel 2019 and Microsoft/Office 365",
            "description": "Enroll now to go through a deep dive of the most popular spreadsheet tool on the market, Microsoft Excel. As a Microsoft Certified Trainer I will use my 20+ years of Excel training to guide you step by step through the beginner to advanced level and beyond.As you participate in each of the 4 courses you will master Excel tools that will clear away the pain of stumbling through your daily tasks. You will start with the basics, building a solid foundation that will give you further knowledge as you progress into intermediate and advanced level topics.At completion of this course you will have mastered the most popular Excel tools and come out with confidence to complete any Excel tasks with efficiency and grace. Below are just a few of the topics that you will master:",
            "topics": " <ul><li>Creating effective spreadsheets</li> <li>Managing large sets of data</li><li>Mastering the use of some of Excel's most popular and highly sought after functions (SUM, VLOOKUP, IF, AVERAGE, INDEX/MATCH and many more...)</li><li>Create dynamic report with Excel PivotTables</li><li>Unlock the power and versatility of Microsoft Excel's Add-In, PowerPivot</li> <li>Audit Excel Worksheet formulas to ensure clean formulas</li><li>Automate your day to day Excel tasks by mastering the power of Macros and VBA</li><ul/>",
            "enrolled": 120,
            "level": "Beginner",
            "lectures": 32,
            "duration": "34:41:31",
            "languages": "English"
        }
    },
    {
        "id": "635966b57b731b62179067aa",
        "title": "Linux for Beginners",
        "price": 59,
        "thumbnail_url": "https://hackr.io/blog/best-linux-courses/thumbnail/large",
        "photo_url": "https://hackr.io/blog/best-linux-courses/thumbnail/large",
        "instructor": {
            "name": "Ellis Edwards",
            "img": "https://i.ibb.co/w09RGLM/Avatar-3.png"
        },
        "ratings": {
            "star": 4.5,
            "number": 223
        },
        "details": {
            "heading": "An Introduction to the Linux Operating System and Command Line",
            "description": "If you want to learn how to use Linux, but don't know where to start read on. Knowing where to start when learning a new skill can be a challenge, especially when the topic seems so vast. There can be so much information available that you can't even decide where to start. Or worse, you start down the path of learning and quickly discover too many concepts, commands, and nuances that aren't explained. This kind of experience is frustrating and leaves you with more questions than answers. Linux for Beginners doesn't make any assumptions about your background or knowledge of Linux. You need no prior knowledge to benefit from this course. You will be guided step by step using a logical and systematic approach. As new concepts, commands, or jargon are encountered they are explained in plain language, making it easy for anyone to understand.",
            "topics": " <ul><li>How to get access to a Linux server if you don't already</li><li>What a Linux distribution is and which one to choose.</li><li>What software is needed to connect to Linux from Mac and Windows computers.</li><li>What SSH is and how to use it.</li><li>The file system layout of Linux systems and where to find programs, configurations, and documentation.</li> <li>The basic Linux commands you'll use most often.</li><li>Creating, renaming, moving, and deleting directories.</li><li>Listing, reading, creating, editing, copying, and deleting files.<li/><li>How to schedule and automate jobs using cron.<li/><li>How to switch users and run processes as others.<li/><li>How to find and install software.<li/><ul/>",
            "enrolled": 45,
            "level": "Beginner",
            "lectures": 42,
            "duration": "30:41:31",
            "languages": "English"
        }
    },
    {
        "id": "635966b51d98f7449830d987",
        "title": "Docker Crash Course for Beginner",
        "price": 39,
        "thumbnail_url": "https://edutrickz.com/wp-content/uploads/2021/03/docker.png",
        "photo_url": "https://edutrickz.com/wp-content/uploads/2021/03/docker.png",
        "instructor": {
            "name": "Lilly Cook",
            "img": "https://i.ibb.co/pJZvnDg/Avatar-1.png"
        },
        "ratings": {
            "star": 4.5,
            "number": 48
        },
        "details": {
            "heading": "Learn how to develop and deploy web applications with Docker technologies. Take your DevOps skills to the next level.",
            "description": "This course covers all the fundamentals about Docker software and teach you everything you need to know about developing and deploying modern applications with Docker software.In the end of this course, you will gain in-depth knowledge about Docker software and general DevOps skills to help your company or your own project to apply the right docker workflow and continuously deliver better software.Docker software is on the bleeding edge of technology today.  It is also one of the most compelling technologies of the last decade in terms of its disruption to software development, operations, systems architecture, testing and compliance practices.",
            "topics": " <ul><li>Containerize a web-based application with a micro-service approach and automate it using Dockerfile.</li> <li>Design multi-container applications and automate the workflow using Compose.</li><li>Scale Docker workflow with Docker Swarm, orchestrate and deploy a large-scale application across multiple hosts in the cloud.</li><li>Best practices of working with Docker software in the field.</li><li>In-depth knowledge about Docker software and confidence to help your company or your own project to apply the right Docker deployment workflow and continuously deliver better software.</li> <li>Invaluable DevOps skills such as setting up continuous integration pipelines.</li><ul/>",
            "enrolled": 63,
            "level": "Beginner",
            "lectures": 34,
            "duration": "20:41:31",
            "languages": "English"
        }
    },
    {
        "id": "635966b5b6b39139a1c35e19",
        "title": "Introduction to Web Development",
        "price": 35,
        "thumbnail_url": "https://industrialtraining.pro/wp-content/uploads/2021/12/web-development-1.png",
        "photo_url": "https://industrialtraining.pro/wp-content/uploads/2021/12/web-development-1.png",
        "instructor": {
            "name": "Luke Ellis",
            "img": "https://i.ibb.co/ZTGvDCT/Avatar.png"
        },
        "ratings": {
            "star": 3.5,
            "number": 49
        },
        "details": {
            "heading": "Are you Interested in Learning Web Development? Enroll in this Free course for a Dynamic Introduction to the Profession!",
            "description": "Are you considering web development as a career? Do you simply want to learn to create your own web sites but don't know where to start? Does the world of programming fascinate you? Are you curious about to be a web developer?.Join master instructor, Mark Lassoff, for this fast paced, short course designed to introduce you to the world of web development. You'll be introduced to three of the primary languages used for web development.This course is designed to give you a preview of what professional web development work is like. You'll use some of the same languages and techniques used by professional web developers every day. With fascinating, fast paced lectures, code samples, and challenging lab exercises (solutions provided) you'll gain a sense of what it's like to work in the web development field.Thousands have learned web development and programming from Mark Lassoff. Join Introduction for Web Development today and start your path towards mastering this exciting and challenging field.",
            "topics": " <ul><li>Understand the technologies used in web development</li> <li>Apply HTML document structure</li><li>Add images to a web page</li><li>Understand the HTML/CSS color model</li><li>Alter CSS text properties</li><li>Understand the next steps to learning professional web development skills</li><ul/>",
            "enrolled": 67,
            "level": "Beginner",
            "lectures": 60,
            "duration": "40:44:31",
            "languages": "English"
        }
    },
    {
        "id": "635966b524cdae20e4df30e3",
        "title": "PHP for Beginners - Become a PHP Master - CMS Project",
        "price": 59,
        "thumbnail_url": "https://www.fossmint.com/wp-content/uploads/2020/03/Best-PHP-Courses-for-Beginners.png",
        "photo_url": "https://www.fossmint.com/wp-content/uploads/2020/03/Best-PHP-Courses-for-Beginners.png",
        "instructor": {
            "name": "Tyler Webster",
            "img": "https://i.ibb.co/18Q6vHL/Avatar-4.png"
        },
        "ratings": {
            "star": 4.5,
            "number": 102
        },
        "details": {
            "heading": "PHP for Beginners: learn everything you need to become a professional PHP developer with practical exercises & projects.",
            "description": "This PHP for beginners course introduces you to PHP through carefully crafted examples and fully worked tasks. Learning by doing is what this course is all about. You will experience real world examples of PHP code use. Have you seen other courses that use complex terms or that jump steps and leave you thinking .why did that just happen? You won't find that with this course because every line of code is explained and is very easy to follow.This course has been designed with the coding beginner in mind or those who may have picked up bad habits and wish to refresh their coding skills.On hand to help and guide you is a renowned national award-winning teacher who has taught 1000s of students over a career of over 25 years.",
            "topics": " <ul><li>Databases in PHP</li> <li>Object Oriented PHP</li><li>CMS project-similar to (Wordpress)</li><li>Form Submissions in PHP</li><li>Security in PHP</li><li>Control Structures in PHP</li><li>  Sessions in PHP <li/><li>Authentication <li/><li> Protect your credentials with .ENV <li/><li>  Learn Composer (PHP dependency Manager)<li/><li> Super Globals in PHP <li/><li>Learn to send emails - from PHP or using a third party Package <li/><ul/>",
            "enrolled": 200,
            "level": "Beginner",
            "lectures": 59,
            "duration": "30:41:31",
            "languages": "English"
        }
    }
]